app/controllers/parts_controller.rb

SELECT * FROM `parts`
---
  def index
    @parts = Part.all

SELECT * FROM `parts` ORDER BY (retail_cost - final_cost) desc
---
  def shop
    @parts = Part.all

SELECT * FROM `parts` WHERE (`parts`.`id` = 0)
---
  def show
    @part = Part.find(params[:id])

SELECT * FROM `parts` WHERE (`parts`.`id` = 2)
---
  def edit
    @part = Part.find(params[:id])

INSERT INTO `parts` (`retail_cost`, `final_cost`, `created_at`, `title`, `updated_at`, `car_id`, `offstock`) VALUES(10.0, 20.0, '2011-03-11 15:00:13', 'part 0001', '2011-03-11 15:00:13', 1, 0)
---
  def create
    @part = Part.new(params[:part])

    respond_to do |format|
      if @part.save

SELECT * FROM `parts` WHERE (`parts`.`id` = 2)
UPDATE `parts` SET `updated_at` = '2011-03-12 13:02:02', `final_cost` = 10.0 WHERE `id` = 1
---
  def update
    @part = Part.find(params[:id])

    respond_to do |format|
      if @part.update_attributes(params[:part])

SELECT * FROM `parts` WHERE (`parts`.`id` = 1)
DELETE FROM `parts` WHERE `id` = 1
---
  def destroy
    @part = Part.find(params[:id])
    @part.destroy